//模拟后端传来的数据。
function getDeviceData() {
    var device_data = [
   /*      
        {
            lat: 30.610614,
            lng: 114.443113,
            title: "武汉站电力设备",
            desc: "地址：武汉站",
        },
        
        {
            lat: 30.597248,
            lng: 114.402582,
            title: "欢乐谷电力设备",
            desc: "地址：武汉欢乐谷",
        },*/
        
        {
            lat: 30.516517,
            lng: 114.43104,
            title: "华科电力设备",
            desc: "地址：华中科技大学",
        },
        
        {
            lat: 30.431576,
            lng: 114.383789, 
            title: "汤逊湖电力设备",
            desc: "地址：武汉江夏区汤逊湖",
        },
        
        {
            lat: 30.637123,
            lng: 114.445556 , 
            title: "武钢电力设备",
            desc: "地址：湖北省武汉市青山区环厂西路武汉钢铁(集团)公司",
        },
        {	 
        	lat: 30.50362,
            lng: 114.347426 , 
            title: "南湖公园电力设备",
            desc: "地址：湖北省武汉市南湖公园电力",
        },
       
        {
            lat: 30.446179,
            lng: 114.276244,
            title: "黄家湖电力设备",
            desc: "地址：黄家湖",
        },
     
        {
            lat: 30.53232,
            lng: 114.330573, 
            title: "武昌站电力设备",
            desc: "地址：武昌站",
        },
        
        
        {
            lat: 30.543269,
            lng: 114.256122,
            title: "动物园电力设备",
            desc: "地址：武汉动物园",
        },
        
        {
            lat: 30.486707,
            lng: 114.225508,
            title: "沌口电力设备",
            desc: "地址：武汉沌口",
        },
       
        {
            lat: 30.653869,
            lng: 114.203373,
            title: "金银湖电力设备",
            desc: "地址：金银湖",
        },

    ];
    return device_data;
}